Revit 2026 API

# BuiltInFailuresDesignOptionFailuresDebugLevelsInOptionsError Property

---

This is an internal diagnostic message.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FailureDefinitionId DebugLevelsInOptionsError { get; }
```
```vb
Public Shared ReadOnly Property DebugLevelsInOptionsError As FailureDefinitionId
	Get
```
```cpp
public:
static property FailureDefinitionId^ DebugLevelsInOptionsError {
	FailureDefinitionId^ get ();
}
```
```fsharp
static member DebugLevelsInOptionsError : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId

#### Reference

BuiltInFailuresDesignOptionFailures Class

Autodesk.Revit.DB Namespace